Machine learning models work very well for dataset having only numbers. But how do we handle text information in dataset? Simple approach is to use interger or label encoding but when categorical variables are nominal, using simple label encoding can be problematic. One hot encoding is the technique that can help in this situation. In this example, we will use pandas get_dummies method to create dummy variables that allows us to perform one hot encoding on given dataset. Alternatively we can use sklearn.preprocessing OneHotEncoder as well to create dummy variables.

In this example, lets predict home price based on different hometowns and square feet area.

In [58]:
import pandas as pd
df=pd.read_csv("F:\python example\Dataset\Dharani-ML\one_hot_encoding\homeprices.csv")
df.head(5)

         town  area   price
0  Indranagar  2600  550000
1  Indranagar  3000  565000
2  Indranagar  3200  610000
3  Indranagar  3600  680000
4  Indranagar  4000  725000

The feature 'town' is a categorical variable of nominal data type. Machine learning model work very well for datasets having only numbers. We can handle text information using one of the pandas features called get_dummies method.

In [49]:
dummies = pd.get_dummies(df.town)
dummies

    Indranagar  JP Nagar  Koramangala
0            1         0            0
1            1         0            0
2            1         0            0
3            1         0            0
4            1         0            0
5            0         0            1
6            0         0            1
7            0         0            1
8            0         0            1
9            0         1            0
10           0         1            0
11           0         1            0
12           0         1            0

In [51]:
df_merge = pd.concat([df,dummies],axis='columns')
df_merge

           town  area   price  Indranagar  JP Nagar  Koramangala
0    Indranagar  2600  550000           1         0            0
1    Indranagar  3000  565000           1         0            0
2    Indranagar  3200  610000           1         0            0
3    Indranagar  3600  680000           1         0            0
4    Indranagar  4000  725000           1         0            0
5   Koramangala  2600  585000           0         0            1
6   Koramangala  2800  615000           0         0            1
7   Koramangala  3300  650000           0         0            1
8   Koramangala  3600  710000           0         0            1
9      JP Nagar  2600  575000           0         1            0
10     JP Nagar  2900  600000           0         1            0
11     JP Nagar  3100  620000           0         1            0
12     JP Nagar  3600  695000           0         1            0

Drop one of the dummy column to avoid dummy variable trap

In [7]:
df_final = df_merge.drop(['town','Koramangala'],axis='columns')
df_final

    area   price  Indranagar  JP Nagar
0   2600  550000           1         0
1   3000  565000           1         0
2   3200  610000           1         0
3   3600  680000           1         0
4   4000  725000           1         0
5   2600  585000           0         0
6   2800  615000           0         0
7   3300  650000           0         0
8   3600  710000           0         0
9   2600  575000           0         1
10  2900  600000           0         1
11  3100  620000           0         1
12  3600  695000           0         1

In [9]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()

Dropping dependent variable 'price' and saving independent variables to x

In [11]:
x = df_final.drop(['price'],axis='columns')
x

    area  Indranagar  JP Nagar
0   2600           1         0
1   3000           1         0
2   3200           1         0
3   3600           1         0
4   4000           1         0
5   2600           0         0
6   2800           0         0
7   3300           0         0
8   3600           0         0
9   2600           0         1
10  2900           0         1
11  3100           0         1
12  3600           0         1

Saving dependent variable 'price' to y. We will predict Y.

In [12]:
y=df_final.price
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [13]:
model.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

Now that the model is trained with the given dataset, lets predict home price of JP Nagar with the sqaure feet area of 2800.

In [19]:
model.predict([[2800,0,1]])

array([590775.63964739])

The home price of Koramangala with the sqaure feet area of 3400 is:

In [20]:
model.predict([[3400,0,0]])

array([681241.66845839])

In [21]:
model.score(x,y)

0.9573929037221873

Now we will see how to handle text information using OneHotEncoding

In [22]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

Assign label encoder for categorical variable town using fit_transform method

In [55]:
dfle = df
dfle.town = le.fit_transform(dfle.town)
dfle.head(10)

   town  area   price
0     0  2600  550000
1     0  3000  565000
2     0  3200  610000
3     0  3600  680000
4     0  4000  725000
5     2  2600  585000
6     2  2800  615000
7     2  3300  650000
8     2  3600  710000
9     1  2600  575000

town and area will be our X-> Independent variables.

In [56]:
x=dfle[['town','area']].values
x

array([[   0, 2600],
       [   0, 3000],
       [   0, 3200],
       [   0, 3600],
       [   0, 4000],
       [   2, 2600],
       [   2, 2800],
       [   2, 3300],
       [   2, 3600],
       [   1, 2600],
       [   1, 2900],
       [   1, 3100],
       [   1, 3600]], dtype=int64)

In [57]:
y=dfle.price
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [41]:
from sklearn.preprocessing import OneHotEncoder
ohe=OneHotEncoder(categorical_features=[0])

In [42]:
x=ohe.fit_transform(x).toarray()
x

F:\Softwares\py\lib\site-packages\sklearn\preprocessing\_encoders.py:415: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)
F:\Softwares\py\lib\site-packages\sklearn\preprocessing\_encoders.py:451: DeprecationWarning: The 'categorical_features' keyword is deprecated in version 0.20 and will be removed in 0.22. You can use the ColumnTransformer instead.
  "use the ColumnTransformer instead.", DeprecationWarning)

array([[1.0e+00, 0.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.0e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.2e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 4.0e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.8e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.3e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.9e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.1e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.6e+03]])

In [43]:
x = x[:,1:]
x

array([[0.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 3.0e+03],
       [0.0e+00, 0.0e+00, 3.2e+03],
       [0.0e+00, 0.0e+00, 3.6e+03],
       [0.0e+00, 0.0e+00, 4.0e+03],
       [0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 2.8e+03],
       [0.0e+00, 1.0e+00, 3.3e+03],
       [0.0e+00, 1.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 2.9e+03],
       [1.0e+00, 0.0e+00, 3.1e+03],
       [1.0e+00, 0.0e+00, 3.6e+03]])

In [44]:
model.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [45]:
model.predict([[1,0,2800]])

array([590775.63964739])

In [46]:
model.predict([[0,1,3400]])

array([681241.6684584])